program Project1;

     var
     t  : real = 1.23;
     omega  : real = 0.175;
     z  : real;
     v1 : real;
     b : real;
begin
   z:= sin(omega*t);  // x ~= 0.213592
   // readln(v1); z:=v1; // раскоментить если нужно посчитать дл¤ произвольного с клавиатуры
   //z:= 10;  // раскоментить если нужно проверить первую формулу
   //z:= -0.4; // раскоментить если нужно проверить вторую формулу
   //z:= 0.5;// раскоментить если нужно проверить третью формулу
   if  z>0 then
    b:=  z;
   else
    if (-1 <=z) or (z <=0) then
       b:= 0
   else
       b:= z*z;
  writeln('y = ',b);
 readln;
end.